Revit 2027 API
BRepBuilderPersistentIds.IsAssociatedBRepBuilderValid Method
 Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAssociatedBRepBuilderValid()
Public Function IsAssociatedBRepBuilderValid As Boolean
public:
bool IsAssociatedBRepBuilderValid()
member IsAssociatedBRepBuilderValid : unit -> bool
Return Value
Boolean
 True if the associated BRepBuilder exists, false otherwise.
See Also
Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace